In [2]:
import pandas as pd
import numpy as np
import seaborn as sns                       #visualisation
import matplotlib.pyplot as plt             #visualisation
%matplotlib inline     
sns.set(color_codes=True)

In [35]:
df = pd.read_csv("./dataset/2015-2017_CorporateCC_mb2.csv",engine = 'python')
# To display the top 5 rows 
df.head(5)

,Project Year,Account Number,Account Name,Question Number,Question Name,Row Number,Row Name,Column Number,Column Name,Response Answer
0,2015,58,ABM INDUSTRIES INC,CC0.1,Introduction Please give a general descriptio...,1,NaN,C0a,NaN,ABM (NYSE: ABM) is a leading provider of facil...
1,2015,64,Abbott Laboratories,CC0.1,Introduction Please give a general descriptio...,1,NaN,C0a,NaN,NaN
2,2015,119,Resolute Forest Products Inc.,CC0.1,Introduction Please give a general descriptio...,1,NaN,C0a,NaN,NaN
3,2015,234,"Advanced Call Center Technologies, LLC",CC0.1,Introduction Please give a general descriptio...,1,NaN,C0a,NaN,ACT is domestic (USA) outsourced call center s...
4,2015,285,3M Company,CC0.1,Introduction Please give a general descriptio...,1,NaN,C0a,NaN,NaN

**Check the data types**

In [13]:
df.dtypes

Project Year         int64
Account Number       int64
Account Name        object
Question Number     object
Question Name       object
Row Number           int64
Row Name           float64
Column Number       object
Column Name         object
Response Answer     object
dtype: object

In [22]:
df.count()

Project Year       716739
Account Number     716739
Account Name       716739
Question Number    716739
Question Name      709365
Row Number         716739
Row Name                0
Column Number      709365
Column Name        682533
Response Answer    382545
dtype: int64

**Check for null values in the dataset**

In [23]:
df['Row Name'].isnull().sum()

716739

In [ ]:
#Since the column Row name all the values are blank. We may completely eliminate the column Row Name

**Remove the column Row Name**

In [37]:
df = df.drop(['Row Name'], axis=1)

#del df['Row Name']
#df = df.drop('Row Name', axis=1)
df.head(5)

,Project Year,Account Number,Account Name,Question Number,Question Name,Row Number,Column Number,Column Name,Response Answer
0,2015,58,ABM INDUSTRIES INC,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ABM (NYSE: ABM) is a leading provider of facil...
1,2015,64,Abbott Laboratories,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
2,2015,119,Resolute Forest Products Inc.,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
3,2015,234,"Advanced Call Center Technologies, LLC",CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ACT is domestic (USA) outsourced call center s...
4,2015,285,3M Company,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN

**Rename the column names Account name, Account Number**

In [53]:
df = df.rename(columns={"Account Name": "City", "Account Number":"City_unique_key" })
df.head(5)

,Project Year,City_unique_key,City,Question Number,Question Name,Row Number,Column Number,Column Name,Response Answer
0,2015,58,ABM INDUSTRIES INC,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ABM (NYSE: ABM) is a leading provider of facil...
1,2015,64,Abbott Laboratories,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
2,2015,119,Resolute Forest Products Inc.,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
3,2015,234,"Advanced Call Center Technologies, LLC",CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ACT is domestic (USA) outsourced call center s...
4,2015,285,3M Company,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN

In [59]:
df.shape

(716739, 9)

**Remove duplicate rows**

In [56]:
duplicate_rows_df = df[df.duplicated()]
print("number of duplicate rows: ", duplicate_rows_df.shape)

number of duplicate rows:  (7620, 9)

In [60]:
df.count()

Project Year       716739
City_unique_key    716739
City               716739
Question Number    716739
Question Name      709365
Row Number         716739
Column Number      709365
Column Name        682533
Response Answer    382545
dtype: int64

In [61]:
df = df.drop_duplicates()
df.head(5)

,Project Year,City_unique_key,City,Question Number,Question Name,Row Number,Column Number,Column Name,Response Answer
0,2015,58,ABM INDUSTRIES INC,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ABM (NYSE: ABM) is a leading provider of facil...
1,2015,64,Abbott Laboratories,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
2,2015,119,Resolute Forest Products Inc.,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN
3,2015,234,"Advanced Call Center Technologies, LLC",CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,ACT is domestic (USA) outsourced call center s...
4,2015,285,3M Company,CC0.1,Introduction Please give a general descriptio...,1,C0a,NaN,NaN

In [62]:
df.count()

Project Year       709119
City_unique_key    709119
City               709119
Question Number    709119
Question Name      701758
Row Number         709119
Column Number      701758
Column Name        674927
Response Answer    378741
dtype: int64

In [25]:
df['Column Name'].isnull().sum()

34206

In [50]:
df.head()
column_data = df[['Column Name','Response Answer']]

In [52]:
#print(column_data)
column_data.head(5)
if column_data['column Name']

  Column Name                                    Response Answer
0         NaN  ABM (NYSE: ABM) is a leading provider of facil...
1         NaN                                                NaN
2         NaN                                                NaN
3         NaN  ACT is domestic (USA) outsourced call center s...
4         NaN                                                NaN